# Transformação csv dos dados da API histórico OW

In [169]:
import pandas as pd  
import numpy as np
data = pd.read_csv("bragaUV.csv")

In [170]:
data.head()

     lat   lon              date_iso        date  value
0  41.54 -8.43  2017-06-22T12:00:00Z  1498132800   9.89
1  41.54 -8.43  2017-06-23T12:00:00Z  1498219200   8.95
2  41.54 -8.43  2017-06-24T12:00:00Z  1498305600   8.88
3  41.54 -8.43  2017-06-25T12:00:00Z  1498392000   8.70
4  41.54 -8.43  2017-06-26T12:00:00Z  1498478400   8.65

In [171]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 990 entries, 0 to 989
Data columns (total 5 columns):
lat         990 non-null float64
lon         990 non-null float64
date_iso    990 non-null object
date        990 non-null int64
value       990 non-null float64
dtypes: float64(3), int64(1), object(1)
memory usage: 38.8+ KB

In [172]:
data = data.drop(['lat','lon'],axis=1)

In [173]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 990 entries, 0 to 989
Data columns (total 3 columns):
date_iso    990 non-null object
date        990 non-null int64
value       990 non-null float64
dtypes: float64(1), int64(1), object(1)
memory usage: 23.3+ KB

In [174]:
data['cidade'] = "Braga"

In [175]:
data.head()

               date_iso        date  value cidade
0  2017-06-22T12:00:00Z  1498132800   9.89  Braga
1  2017-06-23T12:00:00Z  1498219200   8.95  Braga
2  2017-06-24T12:00:00Z  1498305600   8.88  Braga
3  2017-06-25T12:00:00Z  1498392000   8.70  Braga
4  2017-06-26T12:00:00Z  1498478400   8.65  Braga

In [176]:
data['mes'] = 0 
for i in range(len(data)): 
    data["date"].iloc[i] = datetime.datetime.fromtimestamp(data["date"].iloc[i]).strftime('%Y-%m-%d') 
    data["mes"].iloc[i] = datetime.datetime.strptime(data["date"].iloc[i], "%Y-%m-%d") 
    data["mes"].iloc[i] = data["mes"].iloc[i].month

In [177]:
data.head()

               date_iso        date  value cidade  mes
0  2017-06-22T12:00:00Z  2017-06-22   9.89  Braga    6
1  2017-06-23T12:00:00Z  2017-06-23   8.95  Braga    6
2  2017-06-24T12:00:00Z  2017-06-24   8.88  Braga    6
3  2017-06-25T12:00:00Z  2017-06-25   8.70  Braga    6
4  2017-06-26T12:00:00Z  2017-06-26   8.65  Braga    6

In [178]:
data = data.drop(['date_iso'],axis=1)

In [179]:
data.head()

         date  value cidade  mes
0  2017-06-22   9.89  Braga    6
1  2017-06-23   8.95  Braga    6
2  2017-06-24   8.88  Braga    6
3  2017-06-25   8.70  Braga    6
4  2017-06-26   8.65  Braga    6

In [181]:
data.to_csv("dataset_limpo.csv",index=False)